/*****************************************************************
** 版权:   
** 文件名: 
** 版本：
** 工作环境:
** 描述：
** 作者:
** 生成日期:
*****************************************************************/
#include "headerfile.h"


/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:
代码编制：
******************************************************************/
void GPIO_Config(void)
{
    P1DIR = 0XE7;
    P1OUT = 0X38;
    ACLK_OFF;
	
    P1IES = 0X08; //高到低转变置标志
    P1IE  = 0X08;
    P1IFG = 0X00;//p1.6=intn中断 p1.0=key中断
	
    P2DIR = 0XDD;//P2.4、P2.5、P2.6输出
    P2OUT = 0X32;
        
    P2IES = 0X02; //init
    P2IE  = 0X02;
    P2IFG = 0X00;
        
    P3DIR = 0XFF;
    P3OUT = 0X00;
        
    P4DIR = 0XFd;
    P4OUT = 0X02;
        
    P6DIR = 0Xfe;
    P6OUT = 0X01;
    
    	
}

/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能: 串口初始化、8位数据位、1位停止位、无校验、波特率9600、收发使能、接收中断开启
代码编制：
******************************************************************/
void UART_Config(void)
{
    P2SEL |= BIT4;
    P2SEL |= BIT5;
    U0CTL|=SWRST;  
    U0CTL|=PENA+PEV+CHAR;
    
    U0TCTL &= ~0xc0;
    U0TCTL |= SSEL0;
    U0BR0 = 13;
    U0BR1 = 0;
    U0MCTL = 0xa;
	
}

/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:LCD初始化、S0-S19 seg段，com0-com4
代码编制：
******************************************************************/
void LCD_Config(void)
{
	P5DIR = 0xff;		
	P5OUT = 0x00;
	P5SEL = 0xfc;

	Empty_AllSeg();

	BTCTL = BTDIV+BTFRFQ1;	//基础定时器
	LCDCTL = LCDON+LCDMX0+LCDMX1+LCDP1+LCDSON;
	//OPenLCD;
	
}
/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:  定时器初始化，500us定时
代码编制：
******************************************************************/
void TIME_Config(void)
{
    TACTL = TASSEL0 + MC0;
    TACCTL0 = CCIE;
    TACCR0 = 0x4000;//8000:1s;4000:0.5;2000:0.25
}


/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:  系统初始化
代码编制：
******************************************************************/
void System_Config(void)
{
    FLL_CTL0 |= DCOPLUS + XCAP10PF;
    SCFI0 |= FN_2; // 
    SCFQCTL = 30; // (121+1) x 32768 x 2 = 7.99 MHz    8m=121, 4M=60;  2M=30
    GPIO_Config();   //IO口初始化
    LCD_Config();    //LCD初始化
    TIME_Config();   //TIME初始化
}


/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:  延时函数
代码编制：
******************************************************************/
void Delay_us(uint16_t t)
{
	while(t--)
	{
		
	}
}

/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:  延时函数
代码编制：
******************************************************************/
void Delay_ms(uint16_t t)
{
	uint16_t i;
        for(i=0;i<t;i++)
        {
            Delay_us(1000);
        }
}

