/*****************************************************************
** 版权:   
** 文件名: 
** 版本：
** 工作环境:
** 描述：
** 作者:
** 生成日期:
*****************************************************************/
#include "headerfile.h"



/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:  IO口中断，一个按键中断、
代码编制：
******************************************************************/
#pragma vector=PORT1_VECTOR
__interrupt void Port1_Int(void)
{
/******************key中断***********************************/
      LPM3_EXIT;
      if((P1IFG & 0x08) == 0x08)
	{
		for(unsigned int i = 0;i<300;i++);
		if((P1IN & 0X08) == 0X00)
		{
			KeyCnt++;//按键序号累加，累加到9自动返回0
			if(KeyCnt == 7)
			{
				KeyCnt = 0;
			}
			Key_flag = 1;
		}
		P1IFG &= (uint8_t)~BIT3;
	}
	
}


/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:  IO口中断，一个ms1022 intn中断
代码编制：
******************************************************************/
#pragma vector=PORT2_VECTOR
__interrupt void Port2_Int(void)
{
	/****************intn中断*************************************/
	LPM3_EXIT;
        if((P2IFG & 0x02) == 0x02)
	{
		for(unsigned int i = 0;i<300;i++);
		if((P2IFG & 0x02) == 0x02)
		{
			Intn_flag = 1;
		}
		P2IFG &= (uint8_t)~BIT1;
	}
}


/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:  512us定时中断
代码编制：
******************************************************************/
#pragma vector=TIMERA0_VECTOR
__interrupt void TimerA0Int(void)
{
    
	time_up++;
	DisplayCnt ++;
	if(DisplayCnt == 4)//  2s
	{
		Display_flag = 1;
		DisplayCnt = 0;
                LPM3_EXIT;
	}
	if(time_up == 4)//2s
	{
		time_up = 0;
                StartTof_flag=1;
                LPM3_EXIT;
	}
        
}