/*****************************************************************
** 版权:   
** 文件名: 
** 版本：
** 工作环境:
** 描述：
** 作者:
** 生成日期:
*****************************************************************/
#include <msp430x44x.h>
#include "i2c.h"
/*****************************************************************
函数名：
入口参数：
参数说明: 
出口参数：
参数说明：
功能:
代码编制：
******************************************************************/
/*******************************************************************************
********************************************************************************
**函数(模块)名称:  SDA_State()
**功能:             
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
type_Bool SDA_State(void)     
{
    type_Bool State_Temp = RESET;
    if((SDA_PxIN & SDA_PxIN_CHECK) == SDA_PxIN_CHECK)
    {
        State_Temp = SET;
    }
    return State_Temp;
}

/************************I2C基本时序*******************************************/


/*******************************************************************************
********************************************************************************
**函数(模块)名称:  Delays()
**功能:            延时 62.5ns*16 大约1us 
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
void Delays( unsigned int t )
{
    while( t-- )
    {
        for( unsigned char i=0;i<16;i++ );
    }
}
/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_Start()
**功能:            标准I2C的起始信号
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
void Delay_5us(void)
{
    _NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();
	_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();
	_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();
	_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();
	_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();
	_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();
	_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();_NOP();
}

/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_Start()
**功能:            标准I2C的起始信号
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
void I2C_Start(void)
{
    SDA_OUT();
    SCL_HIGH();
    SDA_HIGH();
    Delay_5us();   //约5us  tSU:STA 4.7us
    SDA_LOW();
    Delay_5us();   //约5us  tHD:STA 4us
    SCL_LOW();
    Delay_5us();   //tLOW   4.7us
}

/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_Stop()
**功能:            标准I2C的停止信号
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
void I2C_Stop(void)
{
    SDA_OUT();
    SCL_HIGH();
    SDA_LOW();
    Delay_5us();   //tSU:STO 4us
    Delay_5us();
    SDA_HIGH();
    Delay_5us();   //tBUF   4.7us
   // SCL_LOW();
   // SDA_LOW();
   // Delay_5us();
}

/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_ReadSlaveAck()
**功能:            当MCU向EEPROM中写入一个数据后，需要用到该函数来读取EEPROM是否发送了ACK
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
type_Bool I2C_ReadSlaveAck(void)
{
    type_Bool Write_Result = SET;
    
    SDA_IN();
    SCL_HIGH();
    Delay_5us();
    for( unsigned char tmp_t = 0;tmp_t < 100;tmp_t-- )
    {
       // if(SDA_STATE() == RESET)
        if((SDA_PxIN & SDA_PxIN_CHECK) == SDA_PxIN_CHECK)
        //if((P2IN & 0X40) == 0X40)
        {
            Write_Result = RESET;
            break;
        }
    }
    SCL_LOW();
    return Write_Result;
}

/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_SendAck()
**功能:            当MCU接收到EEPROM发过来的一个数据后，正确则返回给EEPROM一个ACK
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
void I2C_SendAck(void)
{
    SDA_OUT();
    
    SDA_LOW();
    SCL_HIGH();
    Delay_5us();
    SCL_LOW();
    Delay_5us();    
}


/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_SendNack()
**功能:            当MCU接收到EEPROM发过来的一个数据后，错误则返回给EEPROM一个NACK
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
void I2C_SendNack(void)
{
    SDA_OUT();
   
    SDA_HIGH();
    SCL_HIGH();
    Delay_5us();
    SCL_LOW();
    Delay_5us();    
}


/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_Read8Bit()
**功能:            MCU从EEPROM中读取一个字节
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
uint8_t I2C_Read8Bit(void)
{
    uint8_t Read_Data = 0;                    //返回值
    
    SDA_IN();                                  //为接收数据作准备 
    for( uint8_t i = 0;i < 8;i++ )
    {
        Read_Data <<= 1;
        SCL_HIGH();
        Delay_5us();
       // if(SDA_STATE())
        if((SDA_PxIN & SDA_PxIN_CHECK) == SDA_PxIN_CHECK)
        {
            Read_Data |= 0x01;
        }       
        SCL_LOW();
        Delay_5us();
    }
    return Read_Data;
}

/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_Write8Bit()
**功能:            MCU向EEPROM中写入一个字节
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
void I2C_Write8Bit( uint8_t Write_Data)
{
    SDA_OUT();
    SCL_LOW();
    Delay_5us();
    for(uint8_t i = 0;i < 8;i++ )
    {       
        if( Write_Data&BYTE_MSB ) 
        {
            SDA_HIGH();                    //最高位是否为1,为1则SDA= 1
        }
        else 
        {
            SDA_LOW();                    //否则 SDA=0
        }
        Delay_5us();                 //满足数据的建立时间
        SCL_HIGH();
        Delay_5us();
        SCL_LOW();
        Delay_5us();
        Write_Data <<= 1;                 //数据左移一位,进入下一轮送数 
    }
    SDA_LOW(); 
    //SDA_IN();
    Delay_5us();
}
/*********************I2C基本时序结束******************************************/


/*********************I2C读写一个字节******************************************/

/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_WriteByte()
**功能:            I2C写一个字节
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
uint8_t I2C_WriteByte(uint8_t WriteByteAdr,uint8_t WriteByte)
{
    uint8_t WriteByteAddress[2] = {0};
    WriteByteAddress[0] = (uint8_t)(WriteByteAdr>>0);   //地址低位
    //WriteByteAddress[1] = (uint8_t)(WriteByteAdr>>8);   //地址高位
    
    /******************起始信号************************************************/    
    I2C_Start();
    
    /******************从机地址************************************************/ 
#ifdef  AdrMode10
    //补
#else    
    I2C_Write8Bit( SlaveAdr | WriteEeprom ); //从发送地址+写
    if( I2C_ReadSlaveAck() == RESET )
    {
        return COM_ERROR;
    }
#endif
    
    /******************数据地址************************************************/
#ifdef DoubleDataMode
    //补
#else
    I2C_Write8Bit( WriteByteAddress[0] );  //发送数据地址
    if( I2C_ReadSlaveAck() == RESET )
    {
        return COM_ERROR;
    }
#endif
    
    /******************发送数据************************************************/
    I2C_Write8Bit( WriteByte );  //发送数据
    if( I2C_ReadSlaveAck() == RESET )
    {
        return COM_ERROR;
    }
    Delay_5us();
    Delay_5us();
    Delay_5us();
    /******************停止信号************************************************/
    I2C_Stop();
   
    return COM_SUCCESSED;    //正常读取数据
}


/*******************************************************************************
********************************************************************************
**函数(模块)名称:  I2C_ReadByte()
**功能:            I2C读一个字节
**输入参数:        无                            		
**输出参数:        无       	
**函数返回值说明:  无
**使用的资源       IIC接口      	
**其它说明:        无
********************************************************************************
*******************************************************************************/
uint8_t I2C_ReadByte(uint8_t ReadByteAdr,uint8_t *ReadByte)
{
    uint8_t ReadByteAddress[2]={0};   
    ReadByteAddress[0]=(uint8_t)(ReadByteAdr>>0);   //16位地址的低8位
   // ReadByteAddress[1]=(uint8_t)(ReadByteAdr>>8);   //16位地址的高8位
  
    /******************起始信号************************************************/ 
    I2C_Start();
    
    /******************从机地址************************************************/ 
#ifdef  AdrMode10
    //补
#else    
    I2C_Write8Bit( SlaveAdr | WriteEeprom ); //从发送地址+写
    if( I2C_ReadSlaveAck() == RESET )
    {
        return COM_ERROR;
    }
#endif
    
    /******************数据地址************************************************/
#ifdef DoubleDataMode
    //补
#else
    I2C_Write8Bit( ReadByteAddress[0] );  //发送数据地址
    if( I2C_ReadSlaveAck() == RESET )
    {
        return COM_ERROR;
    }
#endif
    
    /******************重复起始信号********************************************/
    I2C_Start();
    
    /******************重复从机地址********************************************/ 
#ifdef  AdrMode10
    //补
#else    
    I2C_Write8Bit( SlaveAdr | ReadEeprom ); //从发送地址+读
    if( I2C_ReadSlaveAck() == RESET )
    {
        return COM_ERROR;
    }
#endif    
    
    /******************数据****************************************************/ 
    *ReadByte = I2C_Read8Bit();
    
    I2C_SendNack();
    
    /******************停止信号************************************************/
    I2C_Stop();
    
    return COM_SUCCESSED; 
}
/*********************I2C读写一个字节结束**************************************/


